# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple, modern and secure file encryption tool
brew "age"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Python version management
brew "pyenv"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Cross-shell prompt for astronauts
brew "starship"
# GitHub CLI
brew "gh"
# 1Password command-line tool
brew "1password-cli"
# Kubernetes package manager
brew "helm"
# k3s in docker for local kubernetes development
brew "k3d"
# Highly customizable macOS status bar replacement
brew "sketchybar"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Editor of encrypted files for storing secrets in Git
brew "sops"
# General-purpose programming language designed for robustness, optimality, and maintainability
brew "zig"
# App to build and share containerized applications and microservices
cask "docker"
cask "docker-desktop"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Rust-based terminal with AI features
cask "warp"
# Window Manger for macOS
cask "nikitabobko/tap/aerospace"
# JankyBorders highlights the window in focus
tap "FelixKratz/formulae"
brew "borders"
# MAC CLI to switch audio sources
brew "switchaudio-osx"
# Claude Code CLI for AI-powered coding assistance
cask "claude-code"
# Code formatter for JavaScript, TypeScript, CSS, and more
brew "prettier"
# Fast JavaScript runtime, bundler, test runner and package manager
tap "oven-sh/bun"
brew "bun"
