# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Python version management
brew "pyenv"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Cross-shell prompt for astronauts
brew "starship"
# App to build and share containerized applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Rust-based terminal with AI features
cask "warp"
# Window Manger for macOS
cask "nikitabobko/tap/aerospace"
# JankyBorders highlights the window in focus
tap "FelixKratz/formulae"
cask "borders"
# MAC CLI to switch audio sources
brew "switchaudio-osx"
# Claude Code CLI for AI-powered coding assistance
cask "claude-code"